Repository: nabs-darrel-schreyer/learning-csharp
Catalog: src/Domains/LogisticsDomain/LearningCSharp.Domains.LogisticsDomain.Dtos/Resources/SharedStrings.*.resx
Languages: af

# ShipmentDto_Title
source: Shipment
af: Versending

# ShipmentDto_Id_Name
source: Shipment ID
af: Versending ID

# ShipmentDto_StreetAddress_Name
source: Street Address
af: Straatadres

# ShipmentDto_Suburb_Name
source: Suburb
af: Voorstad

# ShipmentDto_City_Name
source: City
af: Stad

# ShipmentDto_Region_Name
source: Region
af: Streek

# ShipmentDto_PostalCode_Name
source: Postal Code
af: Poskode

# ShipmentDto_Country_Name
source: Country
af: Land

# ShipmentDto_Id_Description
source: Unique identifier for the shipment
af: Unieke identifiseerder vir die versending

# ShipmentDto_StreetAddress_Description
source: Street number and name
af: Straatnommer en naam

# ShipmentDto_Suburb_Description
source: Suburb or locality
af: Voorstad of lokaliteit

# ShipmentDto_City_Description
source: City or town
af: Stad of dorp

# ShipmentDto_Region_Description
source: Region or province
af: Streek of provinsie

# ShipmentDto_PostalCode_Description
source: Postal code
af: Poskode

# ShipmentDto_Country_Description
source: Country (defaults to New Zealand)
af: Land (verstekwaarde is Nieu-Seeland)

# ShipmentDto_Id_IsInvalid
source: Shipment ID is required and cannot be empty
af: Versending ID is vereist en kan nie leeg wees nie

# ShipmentDto_StreetAddress_IsInvalid
source: Street Address is required and must be between 5 and 100 characters
af: Straatadres is vereist en moet tussen 5 en 100 karakters wees

# ShipmentDto_Suburb_IsInvalid
source: Suburb is required and must be between 2 and 50 characters
af: Voorstad is vereist en moet tussen 2 en 50 karakters wees

# ShipmentDto_City_IsInvalid
source: City is required and must be between 2 and 50 characters
af: Stad is vereist en moet tussen 2 en 50 karakters wees

# ShipmentDto_Region_IsInvalid
source: Region is required and must be between 2 and 50 characters
af: Streek is vereist en moet tussen 2 en 50 karakters wees

# ShipmentDto_PostalCode_IsInvalid
source: Postal Code is required and must be exactly 4 digits
af: Poskode is vereist en moet presies 4 syfers wees

# ShipmentDto_Country_IsInvalid
source: Country is required and must be between 2 and 50 characters
af: Land is vereist en moet tussen 2 en 50 karakters wees

# CarrierDto_Title
source: Carrier
af: Vervoerder

# CarrierDto_Id_Name
source: Carrier ID
af: Vervoerder ID

# CarrierDto_Name_Name
source: Company Name
af: Maatskappynaam

# CarrierDto_TelephoneNumber_Name
source: Telephone Number
af: Telefoonnommer

# CarrierDto_Id_Description
source: Unique identifier for the carrier
af: Unieke identifiseerder vir die vervoerder

# CarrierDto_Name_Description
source: Name of the carrier company
af: Naam van die vervoerder maatskappy

# CarrierDto_TelephoneNumber_Description
source: Telephone number of the carrier
af: Telefoonnommer van die vervoerder

# CarrierDto_Id_IsInvalid
source: Carrier ID is required and cannot be empty
af: Vervoerder ID is vereist en kan nie leeg wees nie

# CarrierDto_Name_IsInvalid
source: Company Name is required and must be between 2 and 100 characters
af: Maatskappynaam is vereist en moet tussen 2 en 100 karakters wees

# CarrierDto_TelephoneNumber_IsInvalid
source: Telephone Number is required and must be a valid NZ phone number
af: Telefoonnommer is vereist en moet 'n geldige NZ telefoonnommer wees
