Repository: nabs-darrel-schreyer/learning-csharp
Catalog: src/Domains/HumanResourcesDomain/LearningCSharp.Domains.HumanResourcesDomain.Dtos/Resources/SharedStrings.*.resx
Languages: af

# Employee_Title
source: Employee
af: Werknemer

# Employee_Id_Description
source: Unique identifier for the employee
af: Unieke identifiseerder vir die werknemer

# Employee_EmployeeNumber_Name
source: Employee Number
af: Werknemernommer

# Employee_EmployeeNumber_Description
source: Employee identification number with a 6 character limit
af: Werknemer identifikasienommer met 'n 6 karakter limiet

# Employee_FirstName_Name
source: First Name
af: Voornaam

# Employee_FirstName_Description
source: First name of the employee
af: Voornaam van die werknemer

# Employee_LastName_Name
source: Last Name
af: Van

# Employee_LastName_Description
source: Last name of the employee
af: Van van die werknemer

# Employee_Email_Name
source: Email
af: E-pos

# Employee_Email_Description
source: Email address of the employee
af: E-posadres van die werknemer

# Employee_JobTitle_Name
source: Job Title
af: Postitel

# Employee_JobTitle_Description
source: Job title or position of the employee
af: Postitel of posisie van die werknemer

# Employee_Department_Name
source: Department
af: Departement

# Employee_Department_Description
source: Department where the employee works
af: Departement waar die werknemer werk

# Employee_HireDate_Name
source: Hire Date
af: Aanstelhdatum

# Employee_HireDate_Description
source: Date when the employee was hired
af: Datum wanneer die werknemer aangestel is

# Employee_Salary_Name
source: Salary
af: Salaris

# Employee_Salary_Description
source: Annual salary of the employee
af: Jaarlikse salaris van die werknemer

# Employee_IsActive_Name
source: Is Active
af: Is Aktief

# Employee_IsActive_Description
source: Indicates if the employee is currently active
af: Dui aan of die werknemer tans aktief is

# Employee_Id_IsInvalid
source: Employee ID is required.
af: Werknemer ID is vereist.

# Employee_EmployeeNumber_IsInvalid
source: Employee number is required and must be exactly 6 characters.
af: Werknemernommer is vereist en moet presies 6 karakters wees.

# Employee_FirstName_IsInvalid
source: First name is required and must be between 2 and 50 characters.
af: Voornaam is vereist en moet tussen 2 en 50 karakters wees.

# Employee_LastName_IsInvalid
source: Last name is required and must be between 2 and 50 characters.
af: Van is vereist en moet tussen 2 en 50 karakters wees.

# Employee_Email_IsInvalid
source: Email address is required and must be a valid email format.
af: E-posadres is vereist en moet 'n geldige e-posformaat wees.

# Employee_JobTitle_IsInvalid
source: Job title is required and must be between 2 and 100 characters.
af: Postitel is vereist en moet tussen 2 en 100 karakters wees.

# Employee_Department_IsInvalid
source: Department is required and must be between 2 and 100 characters.
af: Departement is vereist en moet tussen 2 en 100 karakters wees.

# Employee_HireDate_IsInvalid
source: Hire date is required and cannot be in the future.
af: Aanstelhdatum is vereist en kan nie in die toekoms wees nie.

# Employee_Salary_IsInvalid
source: Salary must be greater than 0.
af: Salaris moet groter as 0 wees.

# Manager_Title
source: Manager
af: Bestuurder

# Manager_Id_Description
source: Unique identifier for the manager
af: Unieke identifiseerder vir die bestuurder

# Manager_ManagerNumber_Name
source: Manager Number
af: Bestuurvernommer

# Manager_ManagerNumber_Description
source: Manager identification number
af: Bestuurder identifikasienommer

# Manager_FirstName_Name
source: First Name
af: Voornaam

# Manager_FirstName_Description
source: First name of the manager
af: Voornaam van die bestuurder

# Manager_LastName_Name
source: Last Name
af: Van

# Manager_LastName_Description
source: Last name of the manager
af: Van van die bestuurder

# Manager_Email_Name
source: Email
af: E-pos

# Manager_Email_Description
source: Email address of the manager
af: E-posadres van die bestuurder

# Manager_ManagementLevel_Name
source: Management Level
af: Bestuursvlak

# Manager_ManagementLevel_Description
source: Management level of the manager
af: Bestuursvlak van die bestuurder

# Manager_Department_Name
source: Department
af: Departement

# Manager_Department_Description
source: Department that the manager oversees
af: Departement wat die bestuurder toesig hou

# Manager_DirectReportsCount_Name
source: Direct Reports Count
af: Direkte Rapporte Telling

# Manager_DirectReportsCount_Description
source: Number of direct reports under this manager
af: Aantal direkte rapporte onder hierdie bestuurder

# Manager_ManagementStartDate_Name
source: Management Start Date
af: Bestuur Begindatum

# Manager_ManagementStartDate_Description
source: Date when the manager started in management role
af: Datum wanneer die bestuurder in bestuursrol begin het

# Manager_Salary_Name
source: Salary
af: Salaris

# Manager_Salary_Description
source: Annual salary of the manager
af: Jaarlikse salaris van die bestuurder

# Manager_IsActive_Name
source: Is Active
af: Is Aktief

# Manager_IsActive_Description
source: Indicates if the manager is currently active
af: Dui aan of die bestuurder tans aktief is

# Manager_Id_IsInvalid
source: Manager ID is required.
af: Bestuurder ID is vereist.

# Manager_ManagerNumber_IsInvalid
source: Manager number is required and must be between 3 and 20 characters.
af: Bestuurvernommer is vereist en moet tussen 3 en 20 karakters wees.

# Manager_FirstName_IsInvalid
source: First name is required and must be between 2 and 50 characters.
af: Voornaam is vereist en moet tussen 2 en 50 karakters wees.

# Manager_LastName_IsInvalid
source: Last name is required and must be between 2 and 50 characters.
af: Van is vereist en moet tussen 2 en 50 karakters wees.

# Manager_Email_IsInvalid
source: Email address is required and must be a valid email format.
af: E-posadres is vereist en moet 'n geldige e-posformaat wees.

# Manager_ManagementLevel_IsInvalid
source: Management level is required and must be between 2 and 50 characters.
af: Bestuursvlak is vereist en moet tussen 2 en 50 karakters wees.

# Manager_Department_IsInvalid
source: Department is required and must be between 2 and 100 characters.
af: Departement is vereist en moet tussen 2 en 100 karakters wees.

# Manager_DirectReportsCount_IsInvalid
source: Direct reports count must be 0 or greater.
af: Direkte rapporte telling moet 0 of groter wees.

# Manager_ManagementStartDate_IsInvalid
source: Management start date is required and cannot be in the future.
af: Bestuur begindatum is vereist en kan nie in die toekoms wees nie.

# Manager_Salary_IsInvalid
source: Salary must be greater than 0.
af: Salaris moet groter as 0 wees.
